In [46]:
import pandas as pd

In [47]:
train = pd.read_csv('../data/raw/train.csv',parse_dates=['date'])
holiday = pd.read_csv('../data/raw/holidays_events.csv',parse_dates=['date'])
oil = pd.read_csv('../data/raw/oil.csv',parse_dates=['date'])
stores = pd.read_csv('../data/raw/stores.csv')
transactions = pd.read_csv('../data/raw/transactions.csv',parse_dates=['date'])

In [48]:
print(f"Train dataset shape: {train.shape}")
print(f"Holiday dataset shape: {holiday.shape}")
print(f"Oil dataset shape: {oil.shape}")
print(f"Stores dataset shape: {stores.shape}")
print(f"Transactions dataset shape: {transactions.shape}")

Train dataset shape: (3000888, 6)
Holiday dataset shape: (350, 6)
Oil dataset shape: (1218, 2)
Stores dataset shape: (54, 5)
Transactions dataset shape: (83488, 3)

In [49]:
train.head()

   id       date  store_nbr      family  sales  onpromotion
0   0 2013-01-01          1  AUTOMOTIVE    0.0            0
1   1 2013-01-01          1   BABY CARE    0.0            0
2   2 2013-01-01          1      BEAUTY    0.0            0
3   3 2013-01-01          1   BEVERAGES    0.0            0
4   4 2013-01-01          1       BOOKS    0.0            0

In [50]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000888 entries, 0 to 3000887
Data columns (total 6 columns):
 #   Column       Dtype
---  ------       -----
 0   id           int64
 1   date         datetime64[ns]
 2   store_nbr    int64
 3   family       object
 4   sales        float64
 5   onpromotion  int64
dtypes: datetime64[ns](1), float64(1), int64(3), object(1)
memory usage: 137.4+ MB

In [51]:
train.describe()

,id,date,store_nbr,sales,onpromotion
count,3.000888e+06,3000888,3.000888e+06,3.000888e+06,3.000888e+06
mean,1.500444e+06,2015-04-24 08:27:04.703088384,2.750000e+01,3.577757e+02,2.602770e+00
min,0.000000e+00,2013-01-01 00:00:00,1.000000e+00,0.000000e+00,0.000000e+00
25%,7.502218e+05,2014-02-26 18:00:00,1.400000e+01,0.000000e+00,0.000000e+00
50%,1.500444e+06,2015-04-24 12:00:00,2.750000e+01,1.100000e+01,0.000000e+00
75%,2.250665e+06,2016-06-19 06:00:00,4.100000e+01,1.958473e+02,0.000000e+00
max,3.000887e+06,2017-08-15 00:00:00,5.400000e+01,1.247170e+05,7.410000e+02
std,8.662819e+05,NaN,1.558579e+01,1.101998e+03,1.221888e+01

In [52]:
# check for duplicates
train.duplicated().sum()

np.int64(0)

In [53]:

print("Unique values in train:\n", train.nunique())

Unique values in train:
 id             3000888
date              1684
store_nbr           54
family              33
sales           379610
onpromotion        362
dtype: int64

In [54]:
train.isnull().sum()

id             0
date           0
store_nbr      0
family         0
sales          0
onpromotion    0
dtype: int64

In [55]:
max_sales = train['sales'].max()
print(f"Maximum sales: {max_sales}")

min_sales = train['sales'].min()
print(f"Minimum sales: {min_sales}")

Maximum sales: 124717.0
Minimum sales: 0.0

In [56]:
# Check for negative sales
negative_sales = train[train['sales'] < 0]

# Count and display
print(f"Number of rows with negative sales: {len(negative_sales)}")
if not negative_sales.empty:
    print("\nSample of rows with negative sales:")
    print(negative_sales.head())

Number of rows with negative sales: 0

In [57]:
start_date = train['date'].min()
end_date = train['date'].max()
total_days = (end_date - start_date).days
unique_years = sorted(train['date'].dt.year.unique())
unique_dates = train['date'].nunique()

print(f"Date range: {start_date.date()} to {end_date.date()}")
print(f"Total span of days: {total_days} days")
print(f"Years covered: {unique_years}")

Date range: 2013-01-01 to 2017-08-15
Total span of days: 1687 days
Years covered: [np.int32(2013), np.int32(2014), np.int32(2015), np.int32(2016), np.int32(2017)]

In [58]:
stores.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [59]:
stores.describe()

       store_nbr    cluster
count  54.000000  54.000000
mean   27.500000   8.481481
std    15.732133   4.693395
min     1.000000   1.000000
25%    14.250000   4.000000
50%    27.500000   8.500000
75%    40.750000  13.000000
max    54.000000  17.000000

In [60]:
stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54 entries, 0 to 53
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   store_nbr  54 non-null     int64
 1   city       54 non-null     object
 2   state      54 non-null     object
 3   type       54 non-null     object
 4   cluster    54 non-null     int64
dtypes: int64(2), object(3)
memory usage: 2.2+ KB

In [61]:
stores.duplicated().sum()

np.int64(0)

In [62]:
stores.isnull().sum()

store_nbr    0
city         0
state        0
type         0
cluster      0
dtype: int64

In [63]:
 
print("the number of unique values :\n",stores.nunique())

the number of unique values :
 store_nbr    54
city         22
state        16
type          5
cluster      17
dtype: int64

In [64]:
oil.head()

        date  dcoilwtico
0 2013-01-01         NaN
1 2013-01-02       93.14
2 2013-01-03       92.97
3 2013-01-04       93.12
4 2013-01-07       93.20

In [65]:
oil.describe()

                      date   dcoilwtico
count                 1218  1175.000000
mean   2015-05-02 12:00:00    67.714366
min    2013-01-01 00:00:00    26.190000
25%    2014-03-03 06:00:00    46.405000
50%    2015-05-02 12:00:00    53.190000
75%    2016-06-30 18:00:00    95.660000
max    2017-08-31 00:00:00   110.620000
std                    NaN    25.630476

In [66]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1218 non-null   datetime64[ns]
 1   dcoilwtico  1175 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 19.2 KB

In [67]:
oil.isnull().sum()

date           0
dcoilwtico    43
dtype: int64

In [68]:
oil.nunique()

date          1218
dcoilwtico     998
dtype: int64

In [69]:
oil.duplicated().sum()

np.int64(0)

In [70]:
#handle missing values

oil['dcoilwtico'] = oil['dcoilwtico'].interpolate(method='linear').ffill().bfill()

In [71]:
oil.isnull().sum()

date          0
dcoilwtico    0
dtype: int64

In [72]:
holiday.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         350 non-null    datetime64[ns]
 1   type         350 non-null    object
 2   locale       350 non-null    object
 3   locale_name  350 non-null    object
 4   description  350 non-null    object
 5   transferred  350 non-null    bool
dtypes: bool(1), datetime64[ns](1), object(4)
memory usage: 14.1+ KB

In [73]:
holiday.duplicated().sum()

np.int64(0)

In [74]:
holiday.describe()

                                date
count                            350
mean   2015-04-24 00:45:15.428571392
min              2012-03-02 00:00:00
25%              2013-12-23 06:00:00
50%              2015-06-08 00:00:00
75%              2016-07-03 00:00:00
max              2017-12-26 00:00:00

In [75]:
print("Missing values in holiday\n", holiday.isnull().sum())

Missing values in holiday
 date           0
type           0
locale         0
locale_name    0
description    0
transferred    0
dtype: int64